# Задание 2:
# С помощью срезов и метода index получите из каждой строки с результатом число,
# прибавьте к полученному числу 10, результат сложения распечатайте.
str1 = 'результат операции: 42'
str2 = 'результат операции: 514'
str3 = 'результат работы программы: 9'

x = int(str1[str1.index(':') + 2:])
x += 10
print(x)

y = int(str2[str2.index(':') + 2:])
y += 10
print(y)

z = int(str3[str3.index(':') + 2:])
z += 10
print(z)

# альтернатива через rindex: str1[str1.rindex(' ') + 1:]
# другой вид записи: print(int(str3[str3.index(':') + 2:]) + 10)
