# Задание 3:
# Получите из каждой строки с результатом число, прибавьте к полученному числу 10, результат сложения распечатайте.
def plus_ten(*args):
    for single_string in args:
        x = int(single_string[single_string.index(':') + 2:]) + 10
        print(x)


plus_ten('результат операции: 42', 'результат операции: 514', 'результат работы программы: 9', 'результат: 2')
